Repository: rusel95/AstroSvitla
Catalog: AstroSvitla/Resources/*.lproj/Localizable.strings
Languages: uk

# tab.main
source: Home
uk: Головна

# tab.reports
source: Reports
uk: Звіти

# tab.settings
source: Settings
uk: Налаштування

# nav.reports
source: Saved Reports
uk: Збережені звіти

# nav.settings
source: Settings
uk: Налаштування

# toolbar.saved_reports
source: Saved Reports
uk: Збережені звіти

# alert.generic.title
source: Something went wrong
uk: Щось пішло не так

# alert.generic.message
source: Unknown error. Please try again.
uk: Сталася невідома помилка.

# alert.pdf_failed.title
source: Couldn't export
uk: Не вдалося експортувати

# alert.pdf_failed.message
source: We'll try again in a moment. Please retry.
uk: Спробуйте ще раз трохи пізніше.

# alert.pdf_saved.title
source: Saved
uk: Збережено

# alert.pdf_saved.message
source: PDF exported successfully.
uk: PDF збережено або надіслано успішно.

# action.ok
source: OK
uk: Гаразд

# action.close
source: Close
uk: Закрити

# action.cancel
source: Cancel
uk: Скасувати

# action.back
source: Back
uk: Назад

# action.continue
source: Continue
uk: Продовжити

# action.done
source: Done
uk: Готово

# error.chart.missing_coordinate
source: Birthplace coordinates are missing
uk: Не вказано координати місця народження

# error.chart.calculation_failed
source: Couldn't calculate chart: %@
uk: Не вдалося розрахувати карту: %@

# log.report.persist_failed
source: Report persistence failed
uk: Не вдалося зберегти звіт

# report.navigation_title
source: Report: %@
uk: Звіт: %@

# report.action.export_pdf
source: Export as PDF
uk: Експортувати у PDF

# report.action.generate_another
source: Generate for another area
uk: Згенерувати для іншої сфери

# report.action.start_over
source: Start over
uk: Почати спочатку

# report.section.chart
source: Natal Chart
uk: Натальна карта

# report.section.summary
source: Summary
uk: Короткий огляд

# report.section.influences
source: Key Influences
uk: Ключові впливи

# report.section.analysis
source: Detailed Analysis
uk: Детальний аналіз

# report.section.recommendations
source: Recommendations
uk: Рекомендації

# report.section.knowledge_usage
source: Knowledge Usage
uk: Використання знань

# report.knowledge.used
source: Vector knowledge base used
uk: Векторна база використана

# report.knowledge.not_used
source: Vector knowledge base not used
uk: Векторна база не використовувалась

# report.knowledge.no_snippets
source: No vector snippets were provided.
uk: Векторні уривки не були надані.

# report.export.vector_usage_true
source: Vector knowledge base used: yes
uk: Використання знань з векторної бази: так

# report.export.vector_usage_false
source: Vector knowledge base used: no
uk: Використання знань з векторної бази: ні

# report.export.vector_note_prefix
source: Note
uk: Примітка

# pdf.title
source: Personal Natal Report
uk: Персональний натальний звіт

# pdf.generated_on
source: Generated on %@
uk: Згенеровано %@

# report.export.key_influences_header
source: Key Influences:
uk: Ключові впливи:

# report.export.analysis_header
source: Detailed Analysis:
uk: Детальний аналіз:

# report.export.recommendations_header
source: Recommendations:
uk: Рекомендації:

# calculating.title
source: Calculating your natal chart…
uk: Розраховуємо вашу натальну карту…

# calculating.description
source: We're computing planetary positions, houses, and aspects for your birth moment.
uk: Обчислюємо позиції планет, будинки та аспекти на момент вашого народження.

# calculating.navigation_title
source: Chart Calculation
uk: Розрахунок карти

# generating.title
source: Generating your "%1$@" report…
uk: Створюємо ваш звіт для сфери «%1$@»…

# generating.description
source: We combine expert astrological rules with your birth data.
uk: Ми поєднуємо експертні астрологічні правила з вашими даними народження.

# generating.navigation_title
source: Creating Report
uk: Створення звіту

# reports.error.load_failed
source: Unable to load saved reports.
uk: Не вдалося завантажити збережені звіти.

# reports.empty.title
source: No reports yet
uk: Ще немає звітів

# reports.empty.description
source: Generate your first report to see it here.
uk: Згенеруйте перший звіт, щоб побачити його в списку.

# reports.section.unknown_profile
source: Unnamed profile
uk: Невідомий профіль

# reports.section.no_chart
source: Not linked to a birth chart
uk: Без прив'язки до карти

# reports.section.orphan_notice
source: Report isn't linked to a saved chart
uk: Звіт не прив'язаний до конкретної карти

# reports.item.reading_time
source: ≈%1$d min
uk: ≈%1$d хв

# report.area.finances
source: Finances
uk: Фінанси

# report.area.career
source: Career
uk: Кар'єра

# report.area.relationships
source: Relationships
uk: Стосунки

# report.area.health
source: Health
uk: Здоров'я

# report.area.general
source: General Overview
uk: Загальний огляд

# settings.title
source: Settings
uk: Налаштування

# settings.action.reset_preferences
source: Reset theme and language
uk: Скинути налаштування теми та мови

# settings.alert.reset.title
source: Preferences reset
uk: Налаштування скинуто

# settings.dialog.onboarding.title
source: Replay onboarding?
uk: Повторити онбординг?

# settings.dialog.onboarding.confirm
source: Replay
uk: Повторити

# settings.section.theme
source: Appearance
uk: Тема

# settings.picker.theme
source: Theme
uk: Режим

# settings.theme.system
source: System
uk: Системна

# settings.theme.light
source: Light
uk: Світла

# settings.theme.dark
source: Dark
uk: Темна

# settings.section.language
source: Language
uk: Мова інтерфейсу

# settings.picker.language
source: Interface language
uk: Мова

# settings.language.system
source: Use system default
uk: За замовчуванням системи

# settings.language.ukrainian
source: Ukrainian
uk: Українська

# settings.language.note
source: Changing the language updates interface text. Reports will be generated in the chosen language.
uk: Зміна мови впливає на текст інтерфейсу. Звіти генеруються мовою, яку ви обрали.

# settings.section.onboarding
source: Onboarding
uk: Онбординг

# settings.action.replay_onboarding
source: Replay introduction tour
uk: Показати вступний тур знову

# settings.section.data
source: Data
uk: Дані

# settings.action.data_overview
source: Saved data overview
uk: Збережені дані

# settings.data.reports
source: Reports
uk: Звіти

# settings.data.charts
source: Profiles
uk: Профілі

# settings.data.count
source: Total: %1$d
uk: Усього: %1$d

# settings.data.title
source: Saved Data
uk: Збережені дані

# birth.section.person
source: Person
uk: Особа

# birth.field.name_optional
source: Name (optional)
uk: Ім'я (необов'язково)

# birth.section.details
source: Birth data
uk: Дані народження

# birth.field.date
source: Date
uk: Дата

# birth.field.time
source: Time
uk: Час

# birth.field.location
source: Location
uk: Місце

# birth.help.precision
source: Enter exact birth details. Precise time ensures accurate house calculation.
uk: Введіть точні дані народження для розрахунку натальної карти. Час має бути максимально точним для коректного визначення будинків.

# birth.action.clear_saved
source: Clear saved data
uk: Очистити збережені дані

# birth.navigation.title
source: Birth data
uk: Дані народження

# location.search.loading
source: Searching…
uk: Пошук…

# location.search.hint_short
source: Start typing the city and country (minimum 3 characters).
uk: Почніть вводити місто та країну. Мінімум 3 символи.

# location.search.no_results
source: No matches found. Try a different spelling.
uk: Збігів не знайдено. Спробуйте інший варіант написання.

# location.search.title
source: Search location
uk: Пошук місця

# area.section.birth_details
source: Birth data
uk: Дані про народження

# area.action.view_details
source: View chart details
uk: Переглянути деталі карти

# area.section.choose
source: Choose a focus area
uk: Оберіть сферу життя

# area.navigation.title
source: Select area
uk: Оберіть сферу

# area.action.edit_details
source: Edit data
uk: Змінити дані
